---
type: DoubleArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DoubleArray

`Autodesk.Revit.DB.DoubleArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DoubleArray | — | `public DoubleArray ()` |
| Method | Append | — | `public virtual void Append ( ref double item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual DoubleArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( ref double item , int index )` |
| Method | ReverseIterator | — | `public virtual DoubleArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual double this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |